modm-ext/data.modm.io/docs/svd/header_stm32h573xx.svd
      </registers>
    </peripheral>
    <peripheral derivedFrom="RAMCFG_BKPRAM">
      <name>RAMCFG_BKPRAM_S</name>
      <description>SRAMs configuration controller</description>
      <groupName>RAMCFG</groupName>
      <baseAddress>0x50026100</baseAddress>
    </peripheral>
    <peripheral derivedFrom="ETH">
      <name>ETH_S</name>
      <description>Ethernet MAC</description>
      <groupName>ETH</groupName>
      <baseAddress>0x50028000</baseAddress>
    </peripheral>
    <peripheral derivedFrom="ICACHE">
      <name>ICACHE_S</name>
      <description>Instruction Cache</description>
      <groupName>ICACHE</groupName>
      <baseAddress>0x50030400</baseAddress>
    </peripheral>
    <peripheral derivedFrom="DCACHE1">
      <name>DCACHE1_S</name>
      <description>Data Cache</description>
      <groupName>DCACHE</groupName>
      <baseAddress>0x50031400</baseAddress>
    </peripheral>
    <peripheral derivedFrom="GTZC_TZSC1">
      <name>GTZC_TZSC1_S</name>
      <description>Global TrustZone Controller</description>
      <groupName>GTZC_TZSC</groupName>
      <baseAddress>0x50032400</baseAddress>
    </peripheral>
    <peripheral derivedFrom="GTZC_TZIC1">
      <name>GTZC_TZIC1_S</name>
      <groupName>GTZC_TZIC</groupName>
      <baseAddress>0x50032800</baseAddress>
    </peripheral>
    <peripheral derivedFrom="GTZC_MPCBB1">
      <name>GTZC_MPCBB1_S</name>
      <groupName>GTZC_MPCBB</groupName>
      <baseAddress>0x50032c00</baseAddress>
    </peripheral>
    <peripheral derivedFrom="GTZC_MPCBB1">
      <name>GTZC_MPCBB2_S</name>
      <groupName>GTZC_MPCBB</groupName>
      <baseAddress>0x50033000</baseAddress>
    </peripheral>
    <peripheral derivedFrom="GTZC_MPCBB1">
      <name>GTZC_MPCBB3_S</name>
      <groupName>GTZC_MPCBB</groupName>
      <baseAddress>0x50033400</baseAddress>
    </peripheral>
    <peripheral derivedFrom="GPIOA">
      <name>GPIOA_S</name>
      <description>General Purpose I/O</description>
      <groupName>GPIO</groupName>
      <baseAddress>0x52020000</baseAddress>
    </peripheral>
    <peripheral derivedFrom="GPIOA">
      <name>GPIOB_S</name>
      <description>General Purpose I/O</description>
      <groupName>GPIO</groupName>
      <baseAddress>0x52020400</baseAddress>
    </peripheral>
    <peripheral derivedFrom="GPIOA">
      <name>GPIOC_S</name>
      <description>General Purpose I/O</description>
      <groupName>GPIO</groupName>
      <baseAddress>0x52020800</baseAddress>
    </peripheral>
    <peripheral derivedFrom="GPIOA">
      <name>GPIOD_S</name>
      <description>General Purpose I/O</description>
      <groupName>GPIO</groupName>
      <baseAddress>0x52020c00</baseAddress>
    </peripheral>
    <peripheral derivedFrom="GPIOA">
      <name>GPIOE_S</name>
      <description>General Purpose I/O</description>
      <groupName>GPIO</groupName>
      <baseAddress>0x52021000</baseAddress>
    </peripheral>
    <peripheral derivedFrom="GPIOA">
      <name>GPIOF_S</name>
      <description>General Purpose I/O</description>
      <groupName>GPIO</groupName>
      <baseAddress>0x52021400</baseAddress>
    </peripheral>
    <peripheral derivedFrom="GPIOA">
      <name>GPIOG_S</name>
      <description>General Purpose I/O</description>
      <groupName>GPIO</groupName>
      <baseAddress>0x52021800</baseAddress>
    </peripheral>
    <peripheral derivedFrom="GPIOA">
      <name>GPIOH_S</name>
      <description>General Purpose I/O</description>
      <groupName>GPIO</groupName>
      <baseAddress>0x52021c00</baseAddress>
    </peripheral>
    <peripheral derivedFrom="GPIOA">
      <name>GPIOI_S</name>
      <description>General Purpose I/O</description>
      <groupName>GPIO</groupName>
      <baseAddress>0x52022000</baseAddress>
    </peripheral>
    <peripheral derivedFrom="ADC1">
      <name>ADC1_S</name>
      <description>ADC</description>
      <groupName>ADC</groupName>
      <baseAddress>0x52028000</baseAddress>
    </peripheral>
    <peripheral derivedFrom="ADC1">
      <name>ADC2_S</name>
      <description>ADC</description>
      <groupName>ADC</groupName>
      <baseAddress>0x52028100</baseAddress>
    </peripheral>
    <peripheral derivedFrom="ADC12_COMMON">
      <name>ADC12_COMMON_S</name>
      <groupName>ADC_Common</groupName>
      <baseAddress>0x52028300</baseAddress>
    </peripheral>
    <peripheral derivedFrom="DAC1">
      <name>DAC1_S</name>
      <description>DAC</description>
      <groupName>DAC</groupName>
      <baseAddress>0x52028400</baseAddress>
    </peripheral>
    <peripheral derivedFrom="DCMI">
      <name>DCMI_S</name>
      <description>DCMI</description>
      <groupName>DCMI</groupName>
      <baseAddress>0x5202c000</baseAddress>
    </peripheral>
    <peripheral derivedFrom="PSSI">
      <name>PSSI_S</name>
      <description>PSSI</description>
      <groupName>PSSI</groupName>
      <baseAddress>0x5202c400</baseAddress>
    </peripheral>
    <peripheral derivedFrom="AES">
      <name>AES_S</name>
      <description>AES hardware accelerator</description>
      <groupName>AES</groupName>
      <baseAddress>0x520c0000</baseAddress>
    </peripheral>
    <peripheral derivedFrom="HASH">
      <name>HASH_S</name>
      <description>HASH</description>
      <groupName>HASH</groupName>
      <baseAddress>0x520c0400</baseAddress>
    </peripheral>
    <peripheral derivedFrom="RNG">
      <name>RNG_S</name>
      <description>RNG</description>
      <groupName>RNG</groupName>
      <baseAddress>0x520c0800</baseAddress>
    </peripheral>
    <peripheral derivedFrom="AES">
      <name>SAES_S</name>
      <description>AES hardware accelerator</description>
      <groupName>AES</groupName>
      <baseAddress>0x520c0c00</baseAddress>
    </peripheral>
    <peripheral derivedFrom="PKA">
      <name>PKA_S</name>
      <description>PKA</description>
      <groupName>PKA</groupName>
      <baseAddress>0x520c2000</baseAddress>
    </peripheral>
    <peripheral derivedFrom="SBS">
      <name>SBS_S</name>
      <description>System configuration, Boot and Security</description>
      <groupName>SBS</groupName>
      <baseAddress>0x54000400</baseAddress>
    </peripheral>
    <peripheral derivedFrom="SPI2">
      <name>SPI5_S</name>
      <description>SPI</description>
      <groupName>SPI</groupName>
      <baseAddress>0x54002000</baseAddress>
    </peripheral>
    <peripheral derivedFrom="LPUART1">
      <name>LPUART1_S</name>
      <description>Universal Synchronous Asynchronous Receiver Transmitter</description>
      <groupName>USART</groupName>
      <baseAddress>0x54002400</baseAddress>
    </peripheral>
    <peripheral derivedFrom="I2C1">
      <name>I2C3_S</name>
      <description>Inter-integrated Circuit Interface</description>
      <groupName>I2C</groupName>
      <baseAddress>0x54002800</baseAddress>
    </peripheral>
    <peripheral derivedFrom="I2C1">
      <name>I2C4_S</name>
      <description>Inter-integrated Circuit Interface</description>
      <groupName>I2C</groupName>
      <baseAddress>0x54002c00</baseAddress>
    </peripheral>
    <peripheral derivedFrom="LPTIM2">
      <name>LPTIM1_S</name>
      <description>LPTIMER</description>
      <groupName>LPTIM</groupName>
      <baseAddress>0x54004400</baseAddress>
    </peripheral>
    <peripheral derivedFrom="LPTIM2">
      <name>LPTIM3_S</name>
      <description>LPTIMER</description>
      <groupName>LPTIM</groupName>
      <baseAddress>0x54004800</baseAddress>
    </peripheral>
    <peripheral derivedFrom="LPTIM2">
      <name>LPTIM4_S</name>
      <description>LPTIMER</description>
      <groupName>LPTIM</groupName>
      <baseAddress>0x54004c00</baseAddress>
    </peripheral>
    <peripheral derivedFrom="LPTIM2">
      <name>LPTIM5_S</name>
      <description>LPTIMER</description>
      <groupName>LPTIM</groupName>
      <baseAddress>0x54005000</baseAddress>
    </peripheral>
    <peripheral derivedFrom="LPTIM2">
      <name>LPTIM6_S</name>
      <description>LPTIMER</description>
      <groupName>LPTIM</groupName>
      <baseAddress>0x54005400</baseAddress>
    </peripheral>
