modm-ext/data.modm.io/docs/svd/header_stm32h573xx.svd
    <peripheral derivedFrom="VREFBUF">
      <name>VREFBUF_S</name>
      <description>VREFBUF</description>
      <groupName>VREFBUF</groupName>
      <baseAddress>0x54007400</baseAddress>
    </peripheral>
    <peripheral derivedFrom="RTC">
      <name>RTC_S</name>
      <description>Real-Time Clock</description>
      <groupName>RTC</groupName>
      <baseAddress>0x54007800</baseAddress>
      <interrupt>
        <name>RTC_S</name>
        <description>RTC secure interrupt</description>
        <value>3</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="TAMP">
      <name>TAMP_S</name>
      <description>Tamper and backup registers</description>
      <groupName>TAMP</groupName>
      <baseAddress>0x54007c00</baseAddress>
    </peripheral>
    <peripheral derivedFrom="PWR">
      <name>PWR_S</name>
      <description>Power Control</description>
      <groupName>PWR</groupName>
      <baseAddress>0x54020800</baseAddress>
    </peripheral>
    <peripheral derivedFrom="RCC">
      <name>RCC_S</name>
      <description>Reset and Clock Control</description>
      <groupName>RCC</groupName>
      <baseAddress>0x54020c00</baseAddress>
      <interrupt>
        <name>RCC_S</name>
        <description>RCC secure global interrupt</description>
        <value>10</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="EXTI">
      <name>EXTI_S</name>
      <description>Asynch Interrupt/Event Controller (EXTI)</description>
      <groupName>EXTI</groupName>
      <baseAddress>0x54022000</baseAddress>
    </peripheral>
    <peripheral derivedFrom="OTFDEC1">
      <name>OTFDEC1_S</name>
      <groupName>OTFDEC</groupName>
      <baseAddress>0x56005000</baseAddress>
    </peripheral>
    <peripheral derivedFrom="SDMMC1">
      <name>SDMMC1_S</name>
      <description>Secure digital input/output Interface</description>
      <groupName>SDMMC</groupName>
      <baseAddress>0x56008000</baseAddress>
    </peripheral>
    <peripheral derivedFrom="DLYB_SDMMC1">
      <name>DLYB_SDMMC1_S</name>
      <description>Delay Block DLYB</description>
      <groupName>DLYB</groupName>
      <baseAddress>0x56008400</baseAddress>
    </peripheral>
    <peripheral derivedFrom="DLYB_SDMMC1">
      <name>DLYB_SDMMC2_S</name>
      <description>Delay Block DLYB</description>
      <groupName>DLYB</groupName>
      <baseAddress>0x56008800</baseAddress>
    </peripheral>
    <peripheral derivedFrom="SDMMC1">
      <name>SDMMC2_S</name>
      <description>Secure digital input/output Interface</description>
      <groupName>SDMMC</groupName>
      <baseAddress>0x56008c00</baseAddress>
    </peripheral>
    <peripheral derivedFrom="DLYB_SDMMC1">
      <name>DLYB_OCTOSPI1_S</name>
      <description>Delay Block DLYB</description>
      <groupName>DLYB</groupName>
      <baseAddress>0x5600f000</baseAddress>
    </peripheral>
    <peripheral derivedFrom="FMC_Bank1_R">
      <name>FMC_Bank1_R_S</name>
      <description>Flexible Memory Controller</description>
      <groupName>FMC_Bank1</groupName>
      <baseAddress>0x57000400</baseAddress>
    </peripheral>
    <peripheral derivedFrom="FMC_Bank3_R">
      <name>FMC_Bank3_R_S</name>
      <description>Flexible Memory Controller Bank3</description>
      <groupName>FMC_Bank3</groupName>
      <baseAddress>0x57000480</baseAddress>
    </peripheral>
    <peripheral derivedFrom="FMC_Bank1E_R">
      <name>FMC_Bank1E_R_S</name>
      <description>Flexible Memory Controller Bank1E</description>
      <groupName>FMC_Bank1E</groupName>
      <baseAddress>0x57000504</baseAddress>
    </peripheral>
    <peripheral derivedFrom="FMC_Bank5_6_R">
      <name>FMC_Bank5_6_R_S</name>
      <description>Flexible Memory Controller Bank5 and 6</description>
      <groupName>FMC_Bank5_6</groupName>
      <baseAddress>0x57000540</baseAddress>
    </peripheral>
    <peripheral derivedFrom="OCTOSPI1">
      <name>OCTOSPI1_S</name>
      <description>OCTO Serial Peripheral Interface</description>
      <groupName>XSPI</groupName>
      <baseAddress>0x57001400</baseAddress>
    </peripheral>
  </peripherals>
</device>
